public class Student {
    public String name;
    public int age;
    //ці дві змінні є публічною інформацією і не є конфендиціальними тому public


    private String address;//оголошено як private,
    // тому що це конфіденційна інформація, до якої не повинні мати доступу об'єкти
    // або функції за межами класу Person.


    protected String email; //оголошено як protected,
    // тому що це інформація, яка може бути корисна похідним класам,
    // але не повинна бути доступна безпосередньо ззовні класу або його похідних.
}
